#  Відрізання останніх цифр від числа, результат - то що було відрізано

while True:
    def in_put():
        a = input('введіть число = ')
        if a.isdigit() == False:
            a = input('введіть число = ')
        b = input('Cкільки символів треба відрізати з права = ')
        if b.isdigit() == False:
            b = input('Вкажіть цифрами скільки символів треба відрізати з права = ')
        return print('було відрізано число>>', a[-int(b):])

    in_put()


    x = input('''
        Щоб розпочати знову натисніть любу клавішу
           Якщо бажаєте закінчити натисніть - х
            ''')
    if x.lower() == 'x':
        break
    continue