
a = float(input('введіть суму для порівняння = '))
b = -500
c = -100
d = 0
e = 100
f = 500
if a <= b:
    print(f'Число {int(a)} дорівнює або менше ніж {b}')
elif a <= c:
    print(f'Число {int(a)} дорівнює або менше ніж {c}, але більше ніж {b}')
elif a >= f:
    print(f'Число {int(a)} дорівнює або більше ніж {f}')
elif a >= e:
    print(f'Число {int(a)} дорівнює або більше ніж {e}, але менше {f}')
elif a >= d:
    print(f'Число {int(a)} дорівнює або більше ніж {d}, але менше {e}')
else:
    print(f'Ця рамка відсутня, але я її добавив. Число {int(a)} дорівнює або менше ніж {d}, але більше {c}')



print(type(a))

